Autodesk.Revit.DB.FilterGlobalParameterAssociationRule.RuleValue
The user-supplied global parameter value against which values from a Revit document will be tested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FilterGlobalParameterAssociationRule.#ctor(Autodesk.Revit.DB.FilterableValueProvider,Autodesk.Revit.DB.FilterNumericRuleEvaluator,Autodesk.Revit.DB.ElementId)
Constructs an instance of FilterGlobalParameterAssociationRule.
valueProvider:
A pointer to a "value provider" object that will extract values from a Revit document.
evaluator:
A pointer to the filter rule evaluator object that implements the desired test.
The built-in evaluators implement commonly used tests such as less-than, greater-than
less-than-or-equal-to, equal, etc.
ruleValue:
The user-supplied global parameter value against which values from a Revit document will be tested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FilterGlobalParameterAssociationRule
A filter rule that operates on global parameters ElementId values in a Revit project.
Since:
2017